---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.TryingToAttachWhenJoined
source: html/4bb02504-5f34-ba7b-9155-05c73f84d00b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.TryingToAttachWhenJoined Property

The column and target are joined. The attachment has been removed.

## Syntax (C#)
```csharp
public static FailureDefinitionId TryingToAttachWhenJoined { get; }
```